
# `brew bundle install`
# See https://www.caseyliss.com/2019/10/8/brew-bundle
# and https://gist.github.com/cliss/74782128b9a35366ecac44a7c4b45752

cask_args appdir: "/Applications"

brew "mas"
mas "BetterSnapTool", id: 417375580
mas "DaisyDisk", id: 411643860
mas "Kindle", id: 405399194
mas "Soulver 2", id: 413965349
mas "Theine", id: 955848755
mas "Tweetbot 2", id: 557168941

brew "ack"
brew "bash-completion"
brew "curl"
brew "git"
brew "hashdeep"
brew "hey"
brew "httpie"
brew "jq"
brew "libtool"
brew "readline", link: true
brew "wget"

# Go and Co.
brew "dep"
brew "go"
brew "go-bindata"

# Java and friends...
tap "adoptopenjdk/openjdk"
brew "gradle"
brew "maven"
brew "sbt"
brew "scala"

cask "adoptopenjdk/openjdk/adoptopenjdk11"
cask "betterzip"
cask "docker"
cask "google-cloud-sdk"
cask "intellij-idea"
cask "macdown"
cask "paw"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "visual-studio-code"
