
# `brew bundle install`
# See https://www.caseyliss.com/2019/10/8/brew-bundle
# and https://gist.github.com/cliss/74782128b9a35366ecac44a7c4b45752

cask_args appdir: "/Applications"

brew "mas"
mas "AusweisApp Bund", id: 948660805
mas "BetterSnapTool", id: 417375580
mas "Boop", id: 1518425043
mas "DaisyDisk", id: 411643860
mas "Exporter", id: 1099120373 # Export Notes to Markdown
mas "Kindle", id: 405399194
mas "Pastebot", id: 1179623856
mas "Pixelmator Pro", id: 1289583905
mas "Play Save - Videos Watch Later", id: 1596506190
mas "Soulver 3", id: 1508732804
mas "Theine", id: 955848755
mas "Adblock Plus for Safari ", id: 1432731683
mas "Hush for Safari", id: 1544743900

brew "ack"
brew "awscli"
brew "bash-completion"
brew "curl"
brew "fd"
brew "gh"
brew "git"
brew "hashdeep"
brew "hey"
brew "httpie"
brew "jq"
brew "kubectx"
brew "libtool"
brew "rbenv"
brew "readline", link: true
brew "watch"
brew "wget"

# Go and Co.
brew "dep"
brew "go"
brew "go-bindata"

# Java and friends...
tap "adoptopenjdk/openjdk"
brew "gradle"
brew "maven"
brew "sbt"
brew "scala"

cask "betterzip"
cask "deckset"
cask "docker"
cask "google-cloud-sdk"
cask "imageoptim"
cask "intellij-idea"
cask "macdown"
cask "paw"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "visual-studio-code"
